Repository: debian-live/live-config
Catalog: manpages/po/*/live-config.7.po
Languages: de, fr, pt_br

source: Live Systems Project
de: Live Systems Projekt

source: B<live-config> - System Configuration Components
de: B<live-config> - System Konfiguration Komponenten

source: DESCRIPTION
de: BESCHREIBUNG
pt_br: DESCRIÇÃO

source: B<live-config> contains the components that configure a live system during the boot process (late userspace).
de: B<live-config> enthält die Komponenten welche ein Live System während des Startvorganges (late userspace) konfigurieren.

source: CONFIGURATION
de: KONFIGURATION
pt_br: CONFIGURAÇÃO

source: B<live-config> can be configured through boot parameters or configuration files. If both mechanisms are used for a certain option, the boot parameters take precedence over the configuration files. When using persistency, B<live-config> components are only run once.
de: B<live-config> kann durch Boot Parameter oder Konfigurationsdateien konfiguriert werden. Werden beide Mechanismen für eine bestimmte Option benutzt, so gehen die Boot Parameter den Konfigurationsdateien vor. Wird Persistenz benutzt, so werden die B<live-config> Komponenten nur einmal ausgeführt.

source: If I<live-build>(7) is used to build the live system, the live-config parameters used by default can be set through the --bootappend-live option, see I<lb_config>(1) manual page.
de: Wird I<live-build>(7) benutzt um das Live System zu erstellen, können die Boot Parameter welche standardmässig benutzt werden durch die --bootappend-live Option gesetzt werden, siehe I<lb_config>(1) Manpage.

source: Boot Parameters (components)
de: Boot Parameter (Komponenten)

source: B<live-config> is only activated if 'boot=live' is used as a boot parameter. Additionally, B<live-config> needs to be told which components to run through the 'live-config.components' parameter or which components to not run through the 'live-config.nocomponents' parameter. If both 'live-config.components' and 'live-config.nocomponents' are used, or, if either one is specified multiple times, always the later one takes precedence over the previous one(s).
de: B<live-config> ist nur aktiviert, wenn 'boot=live' als Boot Parameter benutzt wird. Zusätzlich muss B<live-config> durch den Parameter 'live-config.components' angegeben werden, welche Komponenten ausgeführt werden sollen, oder mit dem Parameter 'live-config.nocomponents', welche Komponenten nicht ausgeführt werden sollen. Werden beide beide Parameter oder mehrmals benützt, so geht der in der Reihenfolge lezte allen vorhergehenden vor.

source: All components are run. This is what live images use by default.
de: Alle Komponenten werden ausgeführt. Auf Live Images ist dies das Standardverhalten.

source: B<live-config.components>=I<COMPONENT1>,I<COMPONENT2>, ... I<COMPONENTn> | B<components>=I<COMPONENT1>,I<COMPONENT2>, ... I<COMPONENTn>
de: B<live-config.components>=I<KOMPONENTE1>,I<KOMPONENTE2>, ... I<KOMPONENTEn> | B<config>=I<KOMPONENTE1>,I<KOMPONENTE2>, ... I<KOMPONENTEn>

source: Only the specified components are run. Note that the order matters, e.g. 'live-config.components=sudo,user-setup' would not work since the user needs to be added before it can be configured for sudo. Look at the filenames of the components in /lib/live/config for their ordering number.
de: Nur angegebene Komponenten werden ausgeführt. Die Reihenfolge ist wesentlich, d.h. 'live-config.components=sudo,user-setup' würde nicht funktionieren da der Benutzer zuerst angelegt werden muss bevor für ihn sudo konfiguriert werden kann. Siehe Dateinamen der Komponenten in /lib/live/config für ihre Ordnungsnummer.

source: No component is run. This is the same as not using any of 'live-config.components' or 'live-config.nocomponents'.
de: Keine Komponente wird ausgeführt. Dies ist das Gleiche, wie wenn weder 'live-config.components' noch 'live-config.nocomponents' verwendet wird.

source: B<live-config.nocomponents>=I<COMPONENT1>,I<COMPONENT2>, ... I<COMPONENTn> | B<nocomponents>=I<COMPONENT1>,I<COMPONENT2>, ... I<COMPONENTn>
de: B<live-config.nocomponents>=I<KOMPONENTE1>,I<KOMPONENTE2>, ... I<KOMPONENTEn> | B<nocomponents>=I<KOMPONENTE1>,I<KOMPONENTE2>, ... I<KOMPONENTEn>

source: All components are run, except the specified ones.
de: Alle Komponenten werden ausgeführt, ausser die hier spezifizierten Ausnahmen.

source: Boot Parameters (options)
de: Boot Parameter (Optionen)
fr: Paramètres d'amorçage (options)
pt_br: Parâmetros de inicialização (opções)

source: Some individual components can change their behaviour upon a boot parameter.
de: Manche einzelne Komponenten können durch Boot Parameter in ihrem Verhalten beinflusst werden.

source: Allows to fetch and apply one or more debconf preseed files to be applied to the debconf database. Note that the URLs must be fetchable by wget (http, ftp or file://).
de: Ermöglicht eine oder mehrere Debconf Preseed Dateien auf die Debconf Datenbank anzuwenden. Die URLs müssen durch wget (http, ftp oder file://) aufösbar sein.

source: If the file is placed on the live medium, it can be fetched with file:///lib/live/mount/medium/I<FILE>, or with file:///I<FILE> if it is in the root filesystem of the live system itself.
de: Falls die Datei sich auf dem Live Medium befindet, kann sie mittels file:///lib/live/mount/medium/I<FILE> benutzt werden, falls sie sich im Root Dateisystem des Live Systems selbst befindet, mittels file:///I<FILE>.

source: All preseed files in /lib/live/config-preseed/ in the root filesystem of the live system can be automatically enabled with the keyword 'filesystem'.
de: Alle Preseed Dateien in /lib/live/config-preseed/ im Root Dateisystem des Live Systems können mit der Option 'filesystem' automatisch aktiviert werden.

source: All preseed files in /live/config-preseed/ of the live medium can be automatically enabled with the keyword 'medium'.
de: Alle Preseed Dateien in /live/config-preseed/ auf dem Live Medium können mit der Option 'medium' automatisch aktiviert werden.

source: If several mechanisms are combined, then filesystem preseed files are applied first, then medium preseed files, and last the network preseed files.
de: Werden verschiedene Mechanismen kombiniert, so werden die Dateisystem Preseed Dateien zuerst ausgeführt, dann die des Mediums und zuletzt die sich im Netzwerk befindende.

source: B<live-config.hostname>=I<HOSTNAME> | B<hostname>=I<HOSTNAME>
de: B<live-config.hostname>=I<RECHNERNAME> | B<hostname>=I<RECHNERNAME>
fr: B<live-config.hostname>=I<NOM_D_HÔTE> | B<hostname>=I<NOM_D_HÔTE>

source: Allows to set the hostname of the system. The default is 'debian'.
de: Ermöglicht den Rechnernamen des Systems zu wählen. Der Standardname ist 'debian'.
fr: Permet de spécifier un nom d'hôte (hostname) au système. Par défaut ce nom est 'debian'.
pt_br: Permite configurar o hostname do sistema. O padrão é 'debian'.

source: B<live-config.username>=I<USERNAME> | B<username>=I<USERNAME>
de: B<live-config.username>=I<BENUTZERNAME> | B<username>=I<BENUTZERNAME>
fr: B<live-config.username>=I<NOM_D_UTILISATEUR> | B<username>=I<NOM_D_UTILISATEUR>
pt_br: B<live-config.username>=I<NOME_DO_USUARIO> | B<username>=I<NOME_DO_USUARIO>

source: Allows to set the username that gets created for autologin. The default is 'user'.
de: Ermöglicht den Namen des Benutzers zu wählen, welcher für den automatischen Login angelegt wird. Der Standardname ist 'user'.
fr: Permet de spécifier le login du user créé pour l'auto-login. Par défaut ce nom est 'user'.
pt_br: Permite configurar o nome do usuário que será criado para autologin. O padrão 'user'.

source: B<live-config.user-default-groups>=I<GROUP1>,I<GROUP2> ... I<GROUPn> | B<user-default-groups>=I<GROUP1>,I<GROUP2> ... I<GROUPn>
de: B<live-config.user-default-groups>=I<GRUPPE1>,I<GRUPPE2> ... I<GRUPPEn> | B<user-default-groups>=I<GRUPPE1>,I<GRUPPE2> ... I<GRUPPEn>

source: Allows to set the default groups of the users that gets created for autologin is member of. The default is 'audio cdrom dip floppy video plugdev netdev powerdev scanner bluetooth'.
de: Ermöglicht die Standardgruppen für den Benutzer zu wählen, welcher für den automatischen Login angelegt wird. Der Standard ist 'audio cdrom dip floppy video plugdev netdev powerdev scanner bluetooth'.

source: B<live-config.user-fullname>="I<USER FULLNAME>" | B<user-fullname>="I<USER FULLNAME>"
de: B<live-config.user-fullname>="I<VOLLER BENUTZERNAME>" | B<user-fullname>="I<VOLLER BENUTZERNAME>"
fr: B<live-config.user-fullname>="I<NOM_COMPLET_D_UTILISATEUR>" | B<user-fullname>="I<NOM_COMPLET_D_UTILISATEUR>"
pt_br: B<live-config.user-fullname>="I<NOME_COMPLETO_DO_USUÁRIO>" | B<user-fullname>="I<NOME_COMPLETO_DO_USUÁRIO>"

source: Allows to set the fullname of the users that gets created for autologin. On Debian the default is 'Debian Live user'.
de: Ermöglicht den vollen Name für den Benutzer zu wählen, welcher für den automatischen Login angelegt wird. Auf Debian Systemen ist der Standardwert 'Debian Live user'.

source: B<live-config.locales>=I<LOCALE1>,I<LOCALE2> ... I<LOCALEn> | B<locales>=I<LOCALE1>,I<LOCALE2> ... I<LOCALEn>
de: B<live-config.locales>=I<GEBIETSSCHEMA1>,I<GEBIETSSCHEMA2> ... I<GEBIETSSCHEMAn> | B<locales>=I<GEBIETSSCHEMA1>,I<GEBIETSSCHEMA2> ... I<GEBIETSSCHEMAn>
fr: B<live-config.locales>=I<LOCALISATION1>,I<LOCALISATION2> ... I<LOCALISATIONn> | B<locales>=I<LOCALISATION1>,I<LOCALISATION2> ... I<LOCALISATIONn>

source: Allows to set the locale of the system, e.g. 'de_CH.UTF-8'. The default is 'en_US.UTF-8'. In case the selected locale is not already available on the system, it is automatically generated on the fly.
de: Ermöglicht das Gebietsschema des Systems zu wählen, zum Beispiel 'de_CH.UTF-8'. Der Standard ist 'en_US.UTF-8'. Falls das gewünschte Gebietsschema nicht schon auf dem System verfügbar ist, wird es automatisch bei Bedarf generiert.
fr: Permet de spécifier la localisation du système, par exemple 'fr_FR.UTF-8'. Par défaut il s'agit de 'en_US.UTF-8'. Dans le cas où la locale spécifiée n'est pas nativement disponible sur le système, elle est automatiquement générée à la volée.
pt_br: Permite configurar o locale do sistema, por exemplo, 'de_CH.UTF-8'. O padrão é 'en_US.UTF-8'. Se o locale selecionado não estiver disponível no sistema, ele é automaticamente gerado.

source: B<live-config.timezone>=I<TIMEZONE> | B<timezone>=I<TIMEZONE>
de: B<live-config.timezone>=I<ZEITZONE> | B<timezone>=I<ZEITZONE>

source: Allows to set the timezone of the system, e.g. 'Europe/Zurich'. The default is 'UTC'.
de: Ermöglicht die Zeitzone des Systems einzustellen, zum Beispiel 'Europe/Zurich'. Der Standard ist 'UTC'.
fr: Permet de spécifier la timezone du système, par exemple 'Europe/Paris'. Par défaut il s'agit de 'UTC'.
pt_br: Permite configurar o timezone do sistema, por exemplo, 'Europe/Zurich'. O padrão é 'UTC'.

source: B<live-config.keyboard-model>=I<KEYBOARD_MODEL> | B<keyboard-model>=I<KEYBOARD_MODEL>
de: B<live-config.keyboard-model>=I<TASTATUR_MODELL> | B<keyboard-model>=I<TASTATUR_MODELL>
fr: B<live-config.keyboard-model>=I<MODELE_DE_CLAVIER> | B<keyboard-model>=I<MODELE_DE_CLAVIER>
pt_br: B<live-config.keyboard-model>=I<MODELO_DO_TECLADO> | B<keyboard-model>=I<MODELO_DO_TECLADO>

source: Allows to change the keyboard model. There is no default value set.
de: Ermöglicht das Tastatur Modell zu bestimmen. Es ist kein Standardwert gesetzt.
fr: Permet de changer le modèle de clavier. Aucune valeur par défaut n'est indiquée.
pt_br: Permite configurar o modelo do teclado. Não há valor padrão definido.

source: B<live-config.keyboard-layouts>=I<KEYBOARD_LAYOUT1>,I<KEYBOARD_LAYOUT2> ... I<KEYBOARD_LAYOUTn> | B<keyboard-layouts>=I<KEYBOARD_LAYOUT1>,I<KEYBOARD_LAYOUT2> ... I<KEYBOARD_LAYOUTn>
de: B<live-config.keyboard-layouts>=I<TASTATUR_LAYOUT1>,I<TASTATUR_LAYOUT2> ... I<TASTATUR_LAYOUTn> | B<keyboard-layouts>=I<TASTATUR_LAYOUT1>,I<TASTATUR_LAYOUT2> ... I<TASTATUR_LAYOUTn>
fr: B<live-config.keyboard-layouts>=I<CONFIGURATION1_DU_CLAVIER>,I<CONFIGURATION2_DU_CLAVIER> ... I<CONFIGURATIONn_DU_CLAVIER> | B<keyboard-layouts>=I<CONFIGURATION1_DU_CLAVIER>,I<CONFIGURATION2_DU_CLAVIER> ... I<CONFIGURATIONn_DU_CLAVIER>
pt_br: B<live-config.keyboard-layouts>=I<LAYOUT1_DO_TECLADO>,I<LAYOUT2_DO_TECLADO> ... I<LAYOUTn_DO_TECLADO> | B<keyboard-layouts>=I<LAYOUT1_DO_TECLADO>,I<LAYOUT2_DO_TECLADO> ... I<LAYOUTn_DO_TECLADO>

source: Allows to change the keyboard layouts. If more than one is specified, the tools of the desktop environment will allow to switch it under X11. There is no default value set.
de: Ermöglicht die Tastatur Layouts zu bestimmen. Wenn mehr als ein Layout angegeben wird, ermöglichen die Tools der Desktopumgebung das Wechseln unter X11. Es ist kein Standardwert gesetzt.
fr: Permet de changer la configuration du clavier. Si plus d'une configuration est spécifiée, les utilitaires de l'environnement de bureau permettront de passer de l'une à l'autre sous X11. Aucune valeur par défaut n'est spécifiée.
pt_br: Permite configurar layouts de teclado. Se mais de um layout for especificado, as ferramentas do ambiente desktop possibilitarão a troca entre eles no X11. Não há valor padrão definido.

source: B<live-config.keyboard-variants>=I<KEYBOARD_VARIANT1>,I<KEYBOARD_VARIANT2> ... I<KEYBOARD_VARIANTn> | B<keyboard-variants>=I<KEYBOARD_VARIANT1>,I<KEYBOARD_VARIANT2> ... I<KEYBOARD_VARIANTn>
de: B<live-config.keyboard-variants>=I<TASTATUR_VARIANTE1>,I<TASTATUR_VARIANTE2> ... I<TASTATUR_VARIANTEn> | B<keyboard-variants>=I<TASTATUR_VARIANTE1>,I<TASTATUR_VARIANTE2> ... I<TASTATUR_VARIANTEn>

source: Allows to change the keyboard variants. If more than one is specified, the same number of values as keyboard-layouts values should be specified as they will be matched one-to-one in the order specified. Blank values are allowed. The tools of the desktop environment will allow to switch between each layout and variant pair under X11. There is no default value set.
de: Ermöglicht die Tastatur Variante zu bestimmen. Wenn mehr als eine Variante angegeben wird, sollte die gleiche Anzahl an Werten wie Tastatur Layouts angegeben werden weil diese jeweils eins zu eins zugeordnet werden. Leere Werte sind ebenfalls zulässig. Die Tools der Desktopumgebung ermöglichen das Wechseln zwischen jedem Layout und Varianten Paar unter X11. Es ist kein Standardwert gesetzt.

source: B<live-config.keyboard-options>=I<KEYBOARD_OPTIONS> | B<keyboard-options>=I<KEYBOARD_OPTIONS>
de: B<live-config.keyboard-options>=I<TASTATUR_OPTIONEN> | B<keyboard-options>=I<TASTATUR_OPTIONEN>
fr: B<live-config.keyboard-options>=I<OPTIONS_DU_CLAVIER> | B<keyboard-options>=I<OPTIONS_DU_CLAVIER>
pt_br: B<live-config.keyboard-options>=I<OPÇÕES_DE_TECLADO> | B<keyboard-options>=I<OPÇÕES_DE_TECLADO>

source: Allows to change the keyboard options. There is no default value set.
de: Ermöglicht die Tastatur Optionen zu bestimmen. Es ist kein Standardwert gesetzt.

source: Allows to disable sysv services through update-rc.d.
de: Ermöglicht Services durch update-rc.d abzuschalten.
fr: Permet de désactiver des services du sysv via update-rc.d.
pt_br: Permite desabilitar serviços sysv através do update-rc.d.

source: Allows to change if the system is assuming that the hardware clock is set to UTC or not. The default is 'yes'.
de: Ermöglicht zu bestimmen, ob das System davon ausgehen soll, dass die Hardwareuhr auf UTC gestellt ist oder nicht. Der Standard ist 'yes'.
fr: Permet de modifier si le système assume, ou non, que l'horloge hardware soit réglée sur UTC. Par défaut 'oui'.
pt_br: Permite definir se o sistema deve assumir que o relógio do hardware está configurado para UTC ou não. O padrão é 'yes'.

source: Allows to set the x-session-manager through update-alternatives.
de: Ermöglicht den x-session-manager durch update-alternatives zu konfigurieren.
fr: Permet de spécifier le x-session-manager via update-alternatives.
pt_br: Permite definir o gerenciador de sessões do X através do update-alternatives.

source: B<live-config.xorg-driver>=I<XORG_DRIVER> | B<xorg-driver>=I<XORG_DRIVER>
de: B<live-config.xorg-driver>=I<XORG_TREIBER> | B<xorg-driver>=I<XORG_TREIBER>
fr: B<live-config.xorg-driver>=I<DRIVER_PAR_XORG> | B<xorg-driver>=I<DRIVER_PAR_XORG>
pt_br: B<live-config.xorg-driver>=I<DRIVER_DO_XORG> | B<xorg-driver>=I<DRIVER_DO_XORG>

source: Allows to set xorg driver instead of autodetecting it. If a PCI ID is specified in /usr/share/live/config/xserver-xorg/I<DRIVER>.ids within the live system, I<DRIVER> is enforced for these devices. If both a boot parameter and a override is found, the boot parameter takes precedence.
de: Ermöglicht den Xorg Treiber manuell statt automatisch zu bestimmen. Wird eine PCI ID in /usr/share/live/config/xserver-xorg/I<TREIBER>.ids innerhalb des Live Systems angegeben, wird I<TREIBER> für diese Geräte verwended. Wird sowohl ein Boot Parameter als auch ein Vorgabe mittels PCI ID gemacht, hat der Boot Parameter Vorrang.

source: B<live-config.xorg-resolution>=I<XORG_RESOLUTION> | B<xorg-resolution>=I<XORG_RESOLUTION>
de: B<live-config.xorg-resolution>=I<XORG_AUFLÖSUNG> | B<xorg-resolution>=I<XORG_AUFLÖSUNG>
fr: B<live-config.xorg-resolution>=I<RESOLUTION_PAR_XORG> | B<xorg-resolution>=I<RESOLUTION_PAR_XORG>
pt_br: B<live-config.xorg-resolution>=I<RESOLUÇÃO_DO_XORG> | B<xorg-resolution>=I<RESOLUÇÃO_DO_XORG>

source: Allows to set xorg resolution instead of autodetecting it, e.g. 1024x768.
de: Ermöglicht die Xorg Auflösung manuell statt automatisch zu bestimmen. z.B. 1024x768.

source: B<live-config.hooks>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn> | B<hooks>=medium|filesystem|I<URL1>|I<URL2>| ... |I<URLn>
de: B<live-config.hooks>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn> | B<hooks>=I<URL1>|I<URL2>| ... |I<URLn>
fr: B<live-config.hooks>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn> | B<hooks>=I<URL1>|I<URL2>| ... |I<URLn>

source: Allows to fetch and execute one or more arbitrary files. Note that the URLs must be fetchable by wget (http, ftp or file://), the files are executed in /tmp of the running live system, and that the files needs their dependencies, if any, already installed, e.g. if a python script should be executed the system needs python installed. Some hooks for some common use-cases are available at /usr/share/doc/live-config/examples/hooks/ and E<lt>I<http://live-systems.org/other/hooks>E<gt>.
de: Ermöglicht eine oder mehrere beliebige Dateien herunterzuladen und auszuführen. Die URLs müssen durch wget (http, ftp oder file://) aufösbar sein, die Dateien werden in /tmp des laufenden Live Systems ausgeführt und es müssen alle Abhängigkeiten, die für das Ausführen der Dateien notwendig sind,bereits installiert sein, zum Beispiel muss für ein Python Skript bereits Python auf dem System installiert sein. Einige Hooks für häufige Anwendungsfälle sind in /usr/share/doc/live-config/examples/hooks/ und unter E<lt>I<http://live-systems.org/other/hooks>E<gt> verfügbar.

source: All hooks in /lib/live/config-hooks/ in the root filesystem of the live system can be automatically enabled with the keyword 'filesystem'.
de: Alle Dateien in /lib/live/config-hooks/ im Root Dateisystem des Live Systems können mit der Option 'filesystem' automatisch aktiviert werden.

source: All hooks in /live/config-hooks/ of the live medium can be automatically enabled with the keyword 'medium'.
de: Alle Dateien in /live/config-hooks/ auf dem Live Medium können mit der Option 'medium' automatisch aktiviert werden.

source: If several mechanisms are combined, then filesystem hooks are executed first, then medium hooks, and last the network hooks.
de: Werden verschiedene Mechanismen kombiniert, so werden die Dateisystem Hooks zuerst ausgeführt, dann die des Mediums und zuletzt die sich im Netzwerk befindende.
fr: Si plusieurs mécanismes sont combinés, alors les hooks du système de fichier sont exécutés prioritairement, suivis des hooks du media, et enfin des hooks du réseau.
pt_br: Se múltiplos mecanismos são combinados, os hooks do sistema de arquivos são executados primeiro, depois os hooks da mídia, e por fim os hooks da rede.

source: Boot Parameters (shortcuts)
de: Boot Parameter (Abkürzungen)
fr: Paramètres d'amorçage (raccourcis)
pt_br: Parâmetros de Inicialização (atalhos)

source: For some common use cases where it would require to combine several individual parameters, B<live-config> provides shortcuts. This allows both to have full granularity over all the options, as well keep things simple.
de: B<live-config> stellt Abkürzungen für einige häufige verwendete Anwendungsfälle wo sonst verschiedene einzelne Parameter kombiniert werden müssten. Dies gewährleistet sowohl feine Kontrolle über alle Optionen, als einfache Benutzbarkeit.
fr: Dans le cas où il est nécessaire de combiner plusieurs paramètres individuels, B<live-config> fournit des raccourcis. Il permet de mixer facilement plusieurs options.
pt_br: B<live-config> provê atalhos para alguns casos de uso comuns que precisariam da combinação de diversos parâmetros. Isto possibilita uma granularidade total sobre as opções, preservando ainda sua simplicidade.

source: Disables sudo and policykit, the user cannot gain root privileges on the system.
de: Schaltet sudo und policykit ab, ein Benutzer kann keine root Privilegien auf dem System mehr erlangen.

source: B<live-config.noautologin> | B<noautologin>
de: B<live-config.nottyautologin> | B<noautologin>
fr: B<live-config.nottyautologin> | B<noautologin>

source: Disables both the automatic console login and the graphical autologin.
de: Schaltet sowohl den den automatischen Login via TTY ab als auch den automatischen graphischen Login.
fr: Désactive l'auto-login sur la console et l'auto-login graphique.
pt_br: Desabilita o login automático do console, assim como o autologin gráfico.

source: Disables the automatic login on the console, not affecting the graphical autologin.
de: Schaltet den automatischen Login via TTY ab, dies beeinflusst den automatisch graphischen Login nicht.
fr: Désactive l'auto-login sur la console, mais ne concerne pas l'auto-login graphique.
pt_br: Desabilita o login automático do console, não afetando o autologin gráfico.

source: Disables the automatic login with any display manager, not affecting tty autologin.
de: Schaltet den automatischen Login via Display Manager ab, dies beeinflusst den automatischen tty Login nicht.
fr: Désactive l'auto-login avec les gestionnaires graphiques, sans affecter l'auto-login en console (tty).
pt_br: Desabilita o login automático com qualquer gerenciador de display, não afetando o autologin tty.

source: Boot Parameters (special options)
de: Boot Parameter (Spezielle Optionen)
fr: Paramètres d'amorçage (options particulières)
pt_br: Parâmetros de Inicialização (opções especiais)

source: For special use cases there are some special boot paramters.
de: Für spezielle Anwendungsfälle gibt es ein paar spezielle Bootparameter.
fr: Pour certains cas d'utilisation, il existe des paramètres de démarrage spécifiques.
pt_br: Existem alguns parâmetros de inicialização especiais para alguns casos de uso especiais.

source: Enables debug output in live-config.
de: Schaltet debug Ausgaben in live-config an.
fr: Active les messages de débug dans live-config.
pt_br: Habilita sáida de debug no live-config.

source: Configuration Files
de: Konfigurationsdateien
fr: Fichiers de configuration
pt_br: Arquivos de Configuração
