Repository: debian-live/live-config
Catalog: manpages/po/*/live-config.7.po
Languages: de, fr, pt_br

source: B<live-config> is only activated if 'boot=live' is used as a boot parameter. Additionally, B<live-config> needs to be told which scripts to run through the 'live-config' parameter or which scripts to not run through the 'live-noconfig' parameter. If both 'live-config' and 'live-noconfig' are used, or, if either one is specified multiple times, always the later one takes precedence over the previous one(s).
fr: B<live-config> est uniquement activé si 'boot=live' est utilisé en tant que paramètre d'amorçage. Additionnellement, B<live-config> a besoin d'être informé des scripts qui seront lancés via le paramètre 'live-config' ou de ceux qui ne doivent pas être lancés via en utilisant le paramètre 'live-noconfig'. Si 'live-config' et 'live-noconfig' sont utilisés, ou, si l'un d'eux est spécifié plusieurs fois, c'est toujours le dernier qui a la préséance sur ceux qui précèdent.
pt_br: B<live-config> é ativado apenas quando 'boot=live' é usado como parâmetro de inicialização. Adicionalmente, B<live-config> precisa ser informado sobre quais scripts executar, através do parâmetro 'live-config', ou quais scripts não executar, através do parâmetro 'live-noconfig'. Se ambos 'live-config' e 'live-noconfig' forem usados, ou um deles for especificado múltiplas vezes, o último sempre assume precedência sobre o(s) anterior(es).

source: All scripts are run. This is what Debian Live images use by default.
fr: Tous les scripts sont lancés. C'est la configuration par défaut des images Debian Live.
pt_br: Todos os scripts são executados. Isto é o que as imagens do Debian Live usam por padrão.

source: Only the specified scripts are run. Note that the order matters, e.g. 'live-config=sudo,user-setup' would not work since the user needs to be added before it can be configured for sudo. Look at the filenames of the scripts in /lib/live/config for their ordering number.
fr: Seuls les scripts spécifiés sont lancés. Notez que leur ordre importe, -ainsi 'live-config=sudo,user-setup' ne peut pas fonctionner tant que l'utilisateur configuré pour utiliser sudo n'a pas été créé. Regardez les noms des scripts dans /lib/live/config pour les ordonner numériquement.
pt_br: Apenas os scripts especificados são executados. Note que a ordem dos scripts é relevante, por exemplo, 'live-config=sudo,user-setup' não funcionaria pois o usuário precisa ser criado antes de ser configurado para sudo. A ordem dos scripts pelos nomes dos arquivos está definida em /lib/live/config.

source: No script is run. This is the same as not using any of 'live-config' or 'live-noconfig'.
fr: Aucun script n'est lancé. Celà revient au même que de n'utiliser ni 'live-config' ni 'live-noconfig'.
pt_br: Nenhum script é executado. É o mesmo que não usar 'live-config' nem 'live-noconfig'.

source: All scripts are run, except the specified ones.
fr: Tous les scripts sont lancés, à l'exception de ceux spécifiés.
pt_br: Todos os scripts são executados, exceto os especificados.

source: Some individual scripts can change their behaviour upon a boot parameter.
fr: Quelques scripts particuliers peuvent changer leur comportement sur un paramètre d'amorçage.
pt_br: Alguns scripts podem alterar seu comportamento através de um parâmetro de inicialização.

source: Allows to set the fullname of the users that gets created for autologin. The default is 'Debian Live user'.
fr: Permet de spécifier le nom complet des utilisateurs créés pour l'auto-login. Par défaut il s'agit de 'Debian Live user'.
pt_br: Permite configurar o nome completo do usuário que será criado para autologin. O padrão é 'Debian Live user'.

source: B<live-config.keyboard-variant>=I<KEYBOARD_VARIANT> | B<keyboard-variant>=I<KEYBOARD_VARIANT>
fr: B<live-config.keyboard-variant>=I<TYPE_DE_CLAVIER> | B<keyboard-variant>=I<TYPE_DE_CLAVIER>
pt_br: B<live-config.keyboard-variant>=I<VARIANTE_DE_TECLADO> | B<keyboard-variant>=I<VARIANTE_DE_TECLADO>

source: Allows to change the keyboard variant. There is no default value set.
fr: Permet de changer le type de clavier. Aucune valeur par défaut n'est spécifiée.
pt_br: Permite configurar a variente de teclado. Não há valor padrão definido.

source: Allows to change the keyboard options. There are no default value set.
fr: Permet de changer les options du clavier. Aucune valeur par défaut n'est spécifiée.
pt_br: Permite configurar as opções de teclado. Não há valor padrão definido.

source: Allows to set xorg driver instead of autodetecting it.
fr: Permet de spécifier le driver utilisé par xorg plutôt que d'utiliser l'auto-détection.
pt_br: Permite definir o driver do xorg ao invés de auto-detectá-lo.

source: Allows to set xorg resolution instead of autodetecting it.
fr: Permet de spécifier la résolution utilisée par xorg, plutôt que d'utiliser l'auto-détection.
pt_br: Permite definir a resolução do xorg ao invés de auto-detectá-la.

source: Allows to fetch and execute one or more arbitrary files. Note that the URLs must be fetchable by wget (http, ftp or file://), the files are executed in /tmp of the running live system, and that the files needs their dependencies, if any, already installed, e.g. if a python script should be executed the system needs python installed. Some hooks for some common use-cases are available at /usr/share/doc/live-config/examples/hooks/ and E<lt>I<http://live.debian.net/other/hooks>E<gt>.
fr: Permet de soumettre et d'exécuter un ou plusieurs fichiers/scripts spécifiques. Notez que les URLs doivent pouvoir être utilisées par wget (http, ftp or file://), que les fichiers sont exécutés dans /tmp sur le système live, et que les dépendances éventuelles des fichiers doivent être préalablement installées; si vous devez en effet exécuter un script python, vous devez préalablement installer sur le système l'interpréteur python. Quelques modèles (hooks) pour certains cas d'utilisation sont proposés dans /usr/share/doc/live-config/examples/hooks/ et sur E<lt>I<http://live.debian.net/other/hooks>E<gt>.
pt_br: Permite obter e executar um ou mais arquivos arbitrários. Note que as URLs precisam ser acessíveis por wget (http, ftp ou file://), que os arquivos são executados no diretório /tmp do sistema de arquivos em execução, e que os arquivos precisam que suas dependências, se houverem, estejam instaladas. Por exemplo, se um script python deve ser executado, python deve estar instalado no sistema. Alguns hooks para alguns casos de uso comuns estão disponíveis em /usr/share/doc/live-config/examples/hooks/ e E<lt>I<http://live.debian.net/other/hooks>E<gt>.

source: If the file is placed on the live medium, it can be fetched with file:///live/image/I<FILE>, or with file:///I<FILE> if it is in the root filesystem of the live system itself.
fr: Si le fichier est placé dans le média live, il peut être utilisé avec file:///live/image/I<FILE>, ou bien avec file:///I<FILE> s'il est placé à la racine du système de fichier du live système.
pt_br: Se o arquivo estiver na mídia live, ele pode ser obtido através de file:///live/image/I<FILE> ou file:///I<FILE> se estiver no sistema raiz do próprio sistema live.

source: All hooks in /lib/live/hooks/ in the root filesystem of the live system can be automatically be enabled with the keyword 'filesystem'.
fr: Tous les hooks, placés dans /lib/live/hooks/ à la racine du système de fichier, peuvent être automatiquement activés avec le mot clé 'filesystem'.
pt_br: Todos os hooks no diretório /lib/live/hooks do sistema de arquivos raiz do sistema live podem ser automaticamente habilitados com a palavra-chave 'filesystem'.

source: All hooks in /live/hooks/ of the live medium can be automatically be enabled with the keyword 'medium'.
fr: Tous les hooks dans /live/hooks/ du média live peuvent être automatiquement activés avec le mot clé 'medium'.
pt_br: Todos os hooks no diretório /live/hooks/ da mídia live podem ser automaticamente habilitados com a palavra-chave 'medium'.

source: Disables the sudo and policykit, the user cannot gain root privileges on the system.
fr: Désactive les règles du sudo; dans ce cas l'utilisateur ne peut pas bénéficier des privilèges administrateur (root) sur le système.
pt_br: Desabilita o sudo e o policykit, o usuário não pode obter privilégios de root no sistema.

source: Configuration files can be placed either in the root filesystem itself (/etc/live/config.conf, /etc/live/config.d/), or on the live media (live/config.conf, live/config.d/). If both places are used for a certain option, the ones from the live media take precedence over the ones from the root filesystem.
fr: Les fichiers de configuration peuvent être placés soit dans la racine du système de fichiers (/etc/live/config.conf, /etc/live/config.d/), soit sur le média live (live/config.conf, live/config.d/). Si ces deux endroits sont utilisés pour une même option, ceux placés dans le média live ont la préséance sur ceux placés dans la racine du système.
pt_br: Arquivos de configuração podem estar localizados no próprio sistema de arquivos raiz (/etc/live/config.conf, /etc/live/config.d/) ou na mídia live (live/config.conf, live/config.d/). Se ambas as localizações são usadas para determinada opção, as da mídia live assumem precedência sobre as do sistema de arquivo raiz.

source: Although the configuration files placed in the conf.d directories do not require a particular name or suffix, it's suggest for consistency to either use 'vendor.conf' or 'project.conf' as a naming scheme (whereas 'vendor' or 'project' is replaced with the actual name, resulting in a filename like 'debian-eeepc.conf').
fr: Bien que les fichiers de configuration placés dans les répertoires conf.d ne requièrent pas de nom ou suffixe particulier, il est suggéré, par souci de cohérence, d'utiliser 'vendeur.conf' ou 'projet.conf' en tant que modèle de nommage ('vendeur' ou 'projet' étant remplacés par le nom réel issu du nom de fichier comme 'debian-eeepc.conf').
pt_br: Apesar de os arquivos de configuração localizados nos diretórios conf.d não necessitarem de um nome ou sufixo particular, por uma questão de consistência é recomendado usar 'distribuidor.conf' ou 'projeto.conf' como esquema de nomes (onde 'distribuidor' ou 'projeto' deve ser susbstituído pelo nome real, resultando num nome de arquivo como 'debian-eeepc.conf').

source: This variable equals the 'B<live-config>=I<SCRIPT1>,I<SCRIPT2>, ... I<SCRIPTn>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config>=I<SCRIPT1>,I<SCRIPT2>, ... I<SCRIPTn>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config>=I<SCRIPT1>,I<SCRIPT2>, ... I<SCRIPTn>'.

source: This variable equals the 'B<live-noconfig>=I<SCRIPT1>,I<SCRIPT2>, ... I<SCRIPTn>' parameter.
fr: Cette variable correspond au paramètre 'B<live-noconfig>=I<SCRIPT1>,I<SCRIPT2>, ... I<SCRIPTn>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-noconfig>=I<SCRIPT1>,I<SCRIPT2>, ... I<SCRIPTn>'.

source: This variable equals the 'B<live-config.hostname>=I<HOSTNAME>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.hostname>=I<NOM_D_HÔTE>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.hostname>=I<HOSTNAME>'.

source: This variable equals the 'B<live-config.username>=I<USERNAME>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.username>=I<NOM_D_UTILISATEUR>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.username>=I<USERNAME>'.

source: This variable equals the 'B<live-config.user-fullname>="I<USER FULLNAME>"' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.user-fullname>="I<NOM_COMPLET_D_UTILISATEUR">'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.user-fullname>="I<NOME_COMPLETO_DO_USUÁRIO>"'.

source: This variable equals the 'B<live-config.locales>=I<LOCALE1>,I<LOCALE2> ... I<LOCALEn>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.locales>=I<LOCALISATION1>,I<LOCALISATION2> ... I<LOCALISATIONn>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.locales>=I<LOCALE1>,I<LOCALE2> ... I<LOCALEn>'.

source: This variable equals the 'B<live-config.timezone>=I<TIMEZONE>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.timezone>=I<TIMEZONE>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.timezone>=I<TIMEZONE>'.

source: This variable equals the 'B<live-config.utc>=B<yes>|no' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.utc>=B<yes>|no'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.utc>=B<yes>|no'

source: This variable equals the 'B<live-config.keyboard-model>=I<KEYBOARD_MODEL>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.keyboard-model>=I<MODELE_DE_CLAVIER>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.keyboard-model>=I<MODELO_DE_TECLADO>'.

source: This variable equals the 'B<live-config.keyboard-layouts>=I<KEYBOARD_LAYOUT1>,I<KEYBOARD_LAYOUT2> ... I<KEYBOARD_LAYOUTn>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.keyboard-layouts>=I<CONFIGURATION1_DU_CLAVIER>,I<CONFIGURATION2_DU_CLAVIER> ... I<CONFIGURATIONn_DU_CLAVIER>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.keyboard-layouts>=I<LAYOUT1_DE_TECLADO>,I<LAYOUT2_DE_TECLADO> ... I<LAYOUTn_DE_TECLADO>'.

source: B<LIVE_KEYBOARD_VARIANT>=I<KEYBOARD_VARIANT>
fr: B<LIVE_KEYBOARD_VARIANT>=I<TYPE_DE_CLAVIER>
pt_br: B<LIVE_KEYBOARD_VARIANT>=I<VARIANTE_DE_TECLADO>

source: This variable equals the 'B<live-config.keyboard-variant>=I<KEYBOARD_VARIANT>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.keyboard-variant>=I<TYPE_DE_CLAVIER>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.keyboard-variant>=I<VARIANTE_DE_TECLADO>'.

source: This variable equals the 'B<live-config.keyboard-options>=I<KEYBOARD_OPTIONS>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.keyboard-options>=I<OPTIONS_DU_CLAVIER>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.keyboard-options>=I<OPÇÕES_DE_TECLADO>'.

source: This variable equals the 'B<live-config.sysv-rc>=I<SERVICE1>,I<SERVICE2> ... I<SERVICEn>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.sysv-rc>=I<SERVICE1>,I<SERVICE2> ... I<SERVICEn>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.sysv-rc>=I<SERVIÇO1>,I<SERVIÇO2> ... I<SERVIÇOn>'.

source: This variable equals the 'B<live-config.xorg-driver>=I<XORG_DRIVER>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.xorg-driver>=I<DRIVER_PAR_XORG>.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.xorg-driver>=I<DRIVER_DO_XORG>'.

source: This variable equals the 'B<live-config.xorg-resolution>=I<XORG_RESOLUTION>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.xorg-resolution>=I<RESOLUTION_PAR_XORG>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.xorg-resolution>=I<RESOLUÇÃO_DO_XORG>'.

source: This variable equals the 'B<live-config.hooks>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn>' parameter.
fr: Cette variable correspond au paramètre 'B<live-config.hooks>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn>'.
pt_br: Esta variável é equivalente ao parâmetro 'B<live-config.hooks>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn>'.

source: Adding new config scripts
fr: Ajout de nouveaux scripts de configuration
pt_br: Adicionando novos scripts de configuração

source: Downstream projects can put their scripts into /lib/live/config and don't need to do anything else, the scripts will be called automatically during boot.
fr: Les projets dérivés peuvent utiliser leurs propres scripts dans /lib/live/config et n'ont besoin de rien d'autre, les scripts seront appelés lors du démarrage.
pt_br: Projetos derivados podem simplesmente colocar seus scripts em /lib/live/config, nada mais, e eles serão chamados automaticamente durante a inicialização.

source: The scripts are best put into an own debian package. A sample package containing an example script can be found in /usr/share/doc/live-config/examples.
fr: Il est préférable que les scripts soient mis dans leur propre paquet Debian. Un simple paquet contenant un script d'exemple est proposé dans /usr/share/doc/live-config/examples.
pt_br: Os scripts devem ser preferencialmente colocados num pacote debian próprio. Um pacote modelo contendo um script de exemplo pode ser encontrado em /usr/share/doc/live-config/.

source: Removing existing config scripts
fr: Enlever des scripts de configuration existant
pt_br: Removendo scripts de configuração existentes

source: It's not really possible to remove scripts itself in a sane way yet without requiring to ship a locally modified B<live-config> package. However, the same can be achieved by disabling the respective scripts through the live-noconfig mechanism, see above. To avoid to always need specifing disabled scripts through the boot parameter, a configuration file should be used, see above.
fr: Il n'est pas encore vraiment possible d'enlever sans problème les scripts sans avoir besoin de charger un paquet B<live-config> modifié localement. Cependant, on peut réaliser une chose similaire en désactivant les scripts respectifs via le mécanisme live-noconfig, comme indiqué ci-dessus. Afin d'éviter d'avoir à spécifier les scripts désactivés en passant par le paramètre de lancement, vous devriez utiliser un fichier de configuration, voir ci-dessus.
pt_br: De fato ainda não é possível remover scripts de forma segura sem que seja necessário distribuir um pacote B<live-config> modificado localmente. Porém, o mesmo pode ser alcançado desabilitando os scripts respectivos através do mecanismo live-noconfig, como indicado acima. Para evitar que sempre seja necessário especificar scripts desabilitados através de parâmetros de inicialização, um arquivo de configuração deve ser usado. Ver detalhes acima.

source: adds an live user account.
fr: ajoute un compte live d'utilisateur.
pt_br: adiciona uma conta de usuário live.

source: configures autologin in gdm.
fr: configure l'auto-login dans gdm.
pt_br: configura autologin no gdm.

source: configures autologin in gdm3 (squeeze and newer).
fr: configure l'auto-login dans gdm3 (squeeze et plus récent).
pt_br: configura autologin no gdm3 (squeeze e mais recentes).

source: B<apport> (ubuntu only)
fr: B<apport> (seulement ubuntu)
pt_br: B<apport> (apenas ubuntu)

source: makes update-initramfs to also update the live media when using persistency.
fr: permet à update-initramfs de mettre à jour le média live lorsqu'on utlise la persistance.
pt_br: faz com que o update-initramfs também atualize a mídia live quando persistência for usada.

source: automatically load some modules on some architectures.
fr: charge automatiquement certains modules sur certaines architectures.
pt_br: carrega alguns módulos automaticamente em algumas arquiteturas.

source: allows to run arbitrary commands from a script placed on the live media or an http/ftp server.
fr: permet de lancer des commandes particulières depuis un script placé sur le média live, ou sur un serveur http/ftp.
pt_br: permite executar comandos arbitrários a partir de um script localizado na mídia live ou um servidor http/ftp.

source: HOMEPAGE
fr: PAGE D'ACCEUIL

source: More information about live-config and the Debian Live project can be found on the homepage at E<lt>I<http://live.debian.net/>E<gt> and in the manual at E<lt>I<http://live.debian.net/manual/>E<gt>.
fr: Plus d'informations sur live-config et le Debian Live project peuvent être trouvées sur la page E<lt>I<http://live.debian.net/>E<gt> et dans le manuel sur E<lt>I<http://live.debian.net/manual/>E<gt>.
pt_br: Mais informações sobre live-config e o projeto Debian Live podem ser encontradas na página E<lt>I<http://live.debian.net/>E<gt> e no manual disponível em E<lt>I<http://live.debian.net/manual/>E<gt>.

source: Bugs can be reported by submitting a bugreport for the live-config package in the Debian Bug Tracking System at E<lt>I<http://bugs.debian.org/>E<gt> or by writing a mail to the Debian Live mailing list at E<lt>I<debian-live@lists.debian.org>E<gt>.
fr: Les bugs peuvent être signalés en soumettant un rapport de bug à propos du paquet live-config via le Debian Bug Tracking System sur E<lt>I<http://bugs.debian.org/>E<gt> ou en envoyant un mail à la Debian Live mailing list à E<lt>I<debian-live@lists.debian.org>E<gt>
pt_br: Bugs podem ser relatados através da submissão de um reporte de bug para o pacote live-config através do Debian Bug Tracking System em E<lt>I<http://bugs.debian.org/>E<gt> ou enviando um email para a lista de discussão Debian Live em E<lt>I<debian-live@lists.debian.org>E<gt>.

source: live-config was written by Daniel Baumann E<lt>I<daniel@debian.org>E<gt>.
fr: live-config a été conçu par Daniel Baumann E<lt>I<daniel@debian.org>E<gt>.
pt_br: live-config foi escrito por Daniel Baumann E<lt>I<daniel@debian.org>E<gt>.

source: B<live-config.sysv-rc>=I<SERVICE1>,I<SERVICE2> ... I<SERVICEn> | B<sysv-rc>=I<SERVICE1>,I<SERVICE2> ... I<SERVICEn>
pt_br: B<live-config.sysv-rc>=I<SERVIÇO1>,I<SERVIÇO2> ... I<SERVIÇOn> | B<sysv-rc>=I<SERVIÇO1>,I<SERVIÇO2> ... I<SERVIÇOn>

source: B<live-config.x-session-manager=>I<X_SESSION_MANAGER> | B<x-session-manager>=I<X_SESSION_MANAGER>
pt_br: B<live-config.x-session-manager=>I<GERENCIADOR_DE_SESSÕES_DO_X> | B<x-session-manager>=I<GERENCIADOR_DE_SESSÕES_DO_X>

source: B<LIVE_SYSV_RC>=I<SERVICE1>,I<SERVICE2> ... I<SERVICEn>
pt_br: B<LIVE_SYSV_RC>=I<SERVIÇO1>,I<SERVIÇO2> ... I<SERVIÇOn>

source: B<live-config> currently features the following scripts in /lib/live/config.
pt_br: B<live-config> atualmente provê os seguintes scripts em /lib/live/config.
