Repository: debian-live/live-config
Catalog: manpages/po/*/live-config.7.po
Languages: de, fr, pt_br

source: B<live-config> can be configured (but not activated) through configuration files. Everything but the shortcuts that can be configured with a boot parameter can be alternatively also be configured through one or more files. If configuration files are used, the 'boot=live' parameter is still required to activate B<live-config>.
de: B<live-config> kann durch Konfigurationsdateien konfiguriert (nicht aber aktiviert) werden. Abgesehen von Abkürzungen können alle Optionen die durch Boot Parameter konfiguriert werden, auch alternativ durch eine oder mehrere Dateien konfiguriert werden. Wenn Konfigurationsdateien benützt werden, so ist der 'boot=live' Parameter trotzdem noch notwendig um B<live-config> zu aktivieren.
fr: B<live-config> peut être configuré (mais pas activé) par certains fichiers de configuration. Tout, sauf les touches de raccourcis qui peuvent être configurées avec un paramètre d'amorçage, peut être alternativement configuré via un ou plusieurs fichiers. Si des fichiers de configuration sont utilisés, le paramètre 'boot=live' est toujours requis pour activer B<live-config>.
pt_br: B<live-config> pode ser configurado (mas não ativado) através de arquivos de configuração. Tudo o que pode ser configurado com um parâmetro de inicialização pode também ser configurado através de um ou mais arquivos, com exceção dos atalhos. Quando arquivos de configuração são usados, o parâmetro 'boot=live' ainda é necessário para a ativação do B<live-config>.

source: B<Note:> If configuration files are used, either (preferably) all boot parameters should be put into the B<LIVE_CONFIG_CMDLINE> variable, or individual variables can be set. If individual variables are used, the user is required to ensure that all the necessary variables are set to create a valid configuration.
de: B<Hinweis:> Werden Konfigurationsdateien verwendet, dann sollen entweder (vorzugsweise) alle Boot Parameter in die B<LIVE_CONFIG_CMDLINE> Variable gesetzt werden, oder Variablen indivuell gesetzt werden. Werden Variablen individuell gesetzt, muss der Benutzer selbst sicherstellen, dass alle nötigen Variablen gesetzt sind um eine gültige Konfiguration zu erstellen.

source: Configuration files can be placed either in the root filesystem itself (/etc/live/config.conf, /etc/live/config/*), or on the live media (live/config.conf, live/config/*). If both places are used for a certain option, the ones from the live media take precedence over the ones from the root filesystem.
de: Die Konfigurationsdateien können entweder im Root Dateisystem selbst plaziert werden (/etc/live/config.conf, /etc/live/config/*) oder auf dem Live Medium (live/config.conf, live/config/*). Wenn beide Orte für eine bestimmte Option verwendet werden, geht die Konfigurationsdatei auf dem Live Medium dem der im Root Dateisystem enthaltenen vor.

source: Although the configuration files placed in the configuration directories do not require a particular name or suffix, it is suggested for consistency reasons to either use 'vendor.conf' or 'project.conf' as a naming scheme (whereas 'vendor' or 'project' is replaced with the actual name, resulting in a filename like 'progress-linux.conf').
de: Obwohl die Konfigurationsdateien welche in die Konfigurationsverzeichnisse abgelegt werden können keinen bestimmten Namen oder Endung brauchen, ist es aus Konsistenzgründen empfohlen, für diese 'vendor.conf' oder 'project.conf' als Namensschema zu verwenden (wobei 'vendor' oder 'project' mit dem eigentlichen Namen ersetzt wird, resultierend in einem Dateinamen wie 'progress-linux.conf').

source: The actual content of the configuration files consists of one or more of the following variables.
de: Der eigentliche Inhalt der Konfigurationsdateien besteht aus einer oder mehreren der folgenden Variablen.

source: This variable corresponds to the bootloader command line.
de: Diese Variable enspricht der Kommandozeile des Bootloaders.

source: B<LIVE_CONFIG_COMPONENTS>=I<COMPONENT1>,I<COMPONENT2>, ... I<COMPONENTn>
de: B<LIVE_CONFIG_COMPONENTS>=I<KOMPONENTE1>,I<KOMPONENTE2>, ... I<KOMPONENTEn>

source: This variable corresponds to the 'B<live-config.components>=I<COMPONENT1>,I<COMPONENT2>, ... I<COMPONENTn>' parameter.
de: Diese Variable enspricht dem 'B<live-config.components>=I<KOMPONENTE1>,I<KOMPONENTE2>, ... I<KOMPONENTEn>' Parameter.

source: B<LIVE_CONFIG_NOCOMPONENTS>=I<COMPONENT1>,I<COMPONENT2>, ... I<COMPONENTn>
de: B<LIVE_CONFIG_NOCOMPONENTS>=I<KOMPONENTE1>,I<KOMPONENTE2>, ... I<KOMPONENTEn>

source: This variable corresponds to the 'B<live-config.nocomponents>=I<COMPONENT1>,I<COMPONENT2>, ... I<COMPONENTn>' parameter.
de: Diese Variable enspricht dem 'B<live-config.nocomponents>=I<KOMPONENTE1>,I<KOMPONENTE2>, ... I<KOMPONENTEn>' Parameter.

source: This variable corresponds to the 'B<live-config.debconf-preseed>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn>' parameter.
de: Diese Variable enspricht dem 'B<live-config.debconf-preseed>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn>' Parameter.

source: B<LIVE_HOSTNAME>=I<HOSTNAME>
de: B<LIVE_HOSTNAME>=I<RECHNERNAME>
fr: B<LIVE_HOSTNAME>=I<NOM_D_HÔTE>

source: This variable corresponds to the 'B<live-config.hostname>=I<HOSTNAME>' parameter.
de: Diese Variable enspricht dem 'B<live-config.hostname>=I<RECHNERNAME>' Parameter.

source: B<LIVE_USERNAME>=I<USERNAME>
de: B<LIVE_USERNAME>=I<BENUTZERNAME>
fr: B<LIVE_USERNAME>=I<NOM_D_UTILISATEUR>

source: This variable corresponds to the 'B<live-config.username>=I<USERNAME>' parameter.
de: Diese Variable enspricht dem 'B<live-config.username>=I<BENUTZERNAME>' Parameter.

source: B<LIVE_USER_DEFAULT_GROUPS>=I<GROUP1>,I<GROUP2> ... I<GROUPn>
de: B<LIVE_USER_DEFAULT_GROUPS>=I<GRUPPE1>,I<GRUPPE2> ... I<GRUPPEn>

source: This variable corresponds to the 'B<live-config.user-default-groups>="I<GROUP1>,I<GROUP2> ... I<GROUPn>"' parameter.
de: Diese Variable enspricht dem 'B<live-config.user-default-groups>=I<GRUPPE1> I<GRUPPE2> ... I<GRUPPEn>' Parameter.

source: B<LIVE_USER_FULLNAME>="I<USER FULLNAME>"
de: B<LIVE_USER_FULLNAME>="I<VOLLER BENUTZERNAME">
fr: B<LIVE_USER_FULLNAME>="I<NOM_COMPLET_D_UTILISATEUR">
pt_br: B<LIVE_USER_FULLNAME>="I<NOME_COMPLETO_DO_USUÁRIO">

source: This variable corresponds to the 'B<live-config.user-fullname>="I<USER FULLNAME>"' parameter.
de: Diese Variable enspricht dem 'B<live-config.user-fullname>="I<VOLLER BENUTZERNAME>"' Parameter.

source: B<LIVE_LOCALES>=I<LOCALE1>,I<LOCALE2> ... I<LOCALEn>
de: B<LIVE_LOCALES>=I<GEBIETSSCHEMA1>,I<GEBIETSSCHEMA2> ... I<GEBIETSSCHEMAn>
fr: B<LIVE_LOCALES>=I<LOCALISATION1>,I<LOCALISATION2> ... I<LOCALISATIONn>

source: This variable corresponds to the 'B<live-config.locales>=I<LOCALE1>,I<LOCALE2> ... I<LOCALEn>' parameter.
de: Diese Variable enspricht dem 'B<live-config.locales>=I<GEBIETSSCHEMA1>,I<GEBIETSSCHEMA2> ... I<GEBIETSSCHEMAn>' Parameter.

source: B<LIVE_TIMEZONE>=I<TIMEZONE>
de: B<LIVE_TIMEZONE>=I<ZEITZONE>

source: This variable corresponds to the 'B<live-config.timezone>=I<TIMEZONE>' parameter.
de: Diese Variable enspricht dem 'B<live-config.timezone>=I<ZEITZONE>' Parameter.

source: B<LIVE_KEYBOARD_MODEL>=I<KEYBOARD_MODEL>
de: B<LIVE_KEYBOARD_MODEL>=I<TASTATUR_MODELL>
fr: B<LIVE_KEYBOARD_MODEL>=I<MODELE_DE_CLAVIER>
pt_br: B<LIVE_KEYBOARD_MODEL>=I<MODELO_DE_TECLADO>

source: This variable corresponds to the 'B<live-config.keyboard-model>=I<KEYBOARD_MODEL>' parameter.
de: Diese Variable enspricht dem 'B<live-config.keyboard-model>=I<TASTATUR_MODELL>' Parameter.

source: B<LIVE_KEYBOARD_LAYOUTS>=I<KEYBOARD_LAYOUT1>,I<KEYBOARD_LAYOUT2> ... I<KEYBOARD_LAYOUTn>
de: B<LIVE_KEYBOARD_LAYOUTS>=I<TASTATUR_LAYOUT1>,I<TASTATUR_LAYOUT2> ... I<TASTATUR_LAYOUTn>
fr: B<LIVE_KEYBOARD_LAYOUTS>=I<CONFIGURATION1_DU_CLAVIER>,I<CONFIGURATION2_DU_CLAVIER> ... I<CONFIGURATIONn_DU_CLAVIER>
pt_br: B<LIVE_KEYBOARD_LAYOUTS>=I<LAYOUT1_DE_TECLADO>,I<LAYOUT2_DE_TECLADO> ... I<LAYOUTn_DE_TECLADO>

source: This variable corresponds to the 'B<live-config.keyboard-layouts>=I<KEYBOARD_LAYOUT1>,I<KEYBOARD_LAYOUT2> ... I<KEYBOARD_LAYOUTn>' parameter.
de: Diese Variable enspricht dem 'B<live-config.keyboard-layouts>=I<TASTATUR_LAYOUT1>,I<TASTATUR_LAYOUT2> ... I<TASTATUR_LAYOUTn>' Parameter.

source: B<LIVE_KEYBOARD_VARIANTS>=I<KEYBOARD_VARIANT1>,I<KEYBOARD_VARIANT2> ... I<KEYBOARD_VARIANTn>
de: B<LIVE_KEYBOARD_VARIANTS>=I<TASTATUR_VARIANTE1>,I<TASTATUR_VARIANTE2> ... I<TASTATUR_VARIANTEn>

source: This variable corresponds to the 'B<live-config.keyboard-variants>=I<KEYBOARD_VARIANT1>,I<KEYBOARD_VARIANT2> ... I<KEYBOARD_VARIANTn>' parameter.
de: Diese Variable enspricht dem 'B<live-config.keyboard-variants>=I<TASTATUR_VARIANTE1>,I<TASTATUR_VARIANTE2> ... I<TASTATUR_VARIANTEn>' Parameter.

source: B<LIVE_KEYBOARD_OPTIONS>=I<KEYBOARD_OPTIONS>
de: B<LIVE_KEYBOARD_OPTIONS>=I<TASTATUR_OPTIONEN>
fr: B<LIVE_KEYBOARD_OPTIONS>=I<OPTIONS_DU_CLAVIER>
pt_br: B<LIVE_KEYBOARD_OPTIONS>=I<OPÇÕES_DE_TECLADO>

source: This variable corresponds to the 'B<live-config.keyboard-options>=I<KEYBOARD_OPTIONS>' parameter.
de: Diese Variable enspricht dem 'B<live-config.keyboard-options>=I<TASTATUR_OPTIONEN>' Parameter.

source: This variable corresponds to the 'B<live-config.sysv-rc>=I<SERVICE1>,I<SERVICE2> ... I<SERVICEn>' parameter.
de: Diese Variable enspricht dem 'B<live-config.sysv-rc>=I<SERVICE1>,I<SERVICE2> ... I<SERVICEn>' Parameter.

source: This variable corresponds to the 'B<live-config.utc>=B<yes>|no' parameter.
de: Diese Variable enspricht dem 'B<live-config.utc>=B<yes>|no' Parameter.

source: This variable corresponds to the 'B<live-config.x-session-manager>=I<X_SESSION_MANAGER>' parameter.
de: Diese Variable enspricht dem 'B<live-config.x-session-manager>=I<X_SESSION_MANAGER>' Parameter.

source: B<LIVE_XORG_DRIVER>=I<XORG_DRIVER>
de: B<LIVE_XORG_DRIVER>=I<XORG_TREIBER>
fr: B<LIVE_XORG_DRIVER>=I<DRIVER_PAR_XORG>
pt_br: B<LIVE_XORG_DRIVER>=I<DRIVER_DO_XORG>

source: This variable corresponds to the 'B<live-config.xorg-driver>=I<XORG_DRIVER>' parameter.
de: Diese Variable enspricht dem 'B<live-config.xorg-driver>=I<XORG_TREIBER>' Parameter.

source: B<LIVE_XORG_RESOLUTION>=I<XORG_RESOLUTION>
de: B<LIVE_XORG_RESOLUTION>=I<XORG_AUFLÖSUNG>
fr: B<LIVE_XORG_RESOLUTION>=I<RESOLUTION_PAR_XORG>
pt_br: B<LIVE_XORG_RESOLUTION>=I<RESOLUÇÃO_DO_XORG>

source: This variable corresponds to the 'B<live-config.xorg-resolution>=I<XORG_RESOLUTION>' parameter.
de: Diese Variable enspricht dem 'B<live-config.xorg-resolution>=I<XORG_AUFLÖSUNG>' Parameter.

source: This variable corresponds to the 'B<live-config.hooks>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn>' parameter.
de: Diese Variable enspricht dem 'B<live-config.hooks>=filesystem|medium|I<URL1>|I<URL2>| ... |I<URLn>' Parameter.

source: This variable corresponds to the 'B<live-config.debug>' parameter.
de: Diese Variable enspricht dem 'B<live-config.debug>' Parameter.

source: CUSTOMIZATION
de: ANPASSUNG
fr: CUSTOMISATION
pt_br: CUSTOMIZAÇÃO

source: B<live-config> can be easily customized for downstream projects or local usage.
de: B<live-config> kann sehr einfach angepasst werden für Downstream Projekte oder lokale Verwendung.
fr: B<live-config> peut être facilement customisé pour des projets dérivés, ou pour un usage local.
pt_br: B<live-config> pode ser facilmente customizado para projetos derivados ou uso local.

source: Adding new config components
de: Hinzufügen von neuen Konfigurationskomponenten

source: Downstream projects can put their components into /lib/live/config and do not need to do anything else, the components will be called automatically during boot.
de: Downstream Projekte können ihre Komponenten in /lib/live/config ablegen und müssen nichts weiteres tun, die Komponenten werden automatisch während des Startens ausgeführt.

source: The components are best put into an own debian package. A sample package containing an example component can be found in /usr/share/doc/live-config/examples.
de: Am Besten werden die Komponenten in ein eigenes Debian Paket untergebracht. Ein Beispielpaket und -komponente befindet sich in /usr/share/doc/live-config/examples.

source: Removing existing config components
de: Entfernen von neuen Konfigurationskomponenten

source: It is not really possible to remove components itself in a sane way yet without requiring either to ship a locally modified B<live-config> package or using dpkg-divert. However, the same can be achieved by disabling the respective components through the live-config.nocomponents mechanism, see above. To avoid to always need specifing disabled components through the boot parameter, a configuration file should be used, see above.
de: Es ist derzeit nicht möglich in einer vernünftigen Art und Weise Komponenten zu entfernen ohne das ein lokal verändertes B<live-config> Paket oder dpkg-divert verwendet werden muss. Jedoch kann das selbe erreicht werden, indem bestimmte Komponenten durch den live-config.nocomponents Mechanismus abgeschaltet werden, siehe oben. Um zu verhindern, dass die abzuschaltenden Komponenten immer durch einen Boot Parameter angegeben werden müssen, kann eine Konfigurationsdatei verwendet werden, siehe oben.

source: The configuration files for the live system itself are best put into an own debian package. A sample package containing an example configuration can be found in /usr/share/doc/live-config/examples.
de: Die Konfigurationsdateien für das Live System selber werden am Besten in einem eigenen Debian Paket untergebracht. Ein Beispielpaket und -konfigurationsdatei befindet sich in /usr/share/doc/live-config/examples.
fr: Les fichiers de configuration pour le système live devront de préférence être inclus dans leur propre paquet debian. Un simple paquet contenant un exemple de configuration est proposé dans /usr/share/doc/live-config/examples.
pt_br: Os arquivos de configuração para o próprio sistema live devem ser preferencialmente colocados num pacote debian próprio. Um pacote modelo contendo uma configuração de exemplo pode ser encontrado em /usr/share/doc/live-config/examples.

source: B<live-config> currently features the following components in /lib/live/config.
de: B<live-config> enthält derzeit folgende Komponenten in /lib/live/config.

source: allows to apply arbitrary preseed files placed on the live media or an http/ftp server.
de: erlaubt beliebige Preseed Dateien auf dem Live Medium oder von einem HTTP/FTP Server anzuwenden.

source: configures /etc/hostname and /etc/hosts.
de: konfiguriert /etc/hostname und /etc/hosts.
fr: configure /etc/hostname et /etc/hosts.
pt_br: configura o /etc/hostname e /etc/hosts.

source: adds a live user account.
de: fügt das Live Benutzerkonto hinzu.

source: grants sudo privileges to the live user.
de: räumt dem Live Benutzer sudo Privilegien ein.
fr: offre les privilèges sudo à l'utilisateur live.
pt_br: concede privilégios sudo ao usuário live.

source: configures locales.
de: konfiguriert locales.
fr: configure les locales.
pt_br: configura locales.

source: configures locales-all.
de: konfiguriert locales-all.

source: configures /etc/timezone.
de: konfiguriert /etc/timezone.
fr: configure /etc/timezone.
pt_br: configura /etc/timezone.

source: configures autologin in gdm3.
de: konfiguriert Autologin in gdm3.

source: configures autologin in kdm.
de: konfiguriert Autologin in kdm.
fr: configure l'auto-login dans kdm.
pt_br: configura autologin no kdm.

source: configures autologin in lightdm.
de: konfiguriert Autologin in lightdm.
fr: configure l'auto-login dans lightdm.
pt_br: configura autologin no lightdm.

source: configures autologin in lxdm.
de: konfiguriert Autologin in lxdm.
fr: configure l'auto-login dans lxdm.
pt_br: configura autologin no lxdm.

source: configures autologin in nodm.
de: konfiguriert Autologin in nodm.
fr: configure l'auto-login dans nodm.
pt_br: configura autologin no nodm.

source: configures autologin in slim.
de: konfiguriert Autologin in slim.
fr: configure l'auto-login dans slim.
pt_br: configura autologin no slim.

source: configures autologin with xinit.
de: konfiguriert Autologin mit xinit.
fr: configure l'auto-login avec xinit.
pt_br: configura autologin no xinit.

source: configures the keyboard.
de: konfiguriert die Tastatur.
fr: configure le clavier.
pt_br: configura o teclado.

source: configures sysvinit.
de: konfiguriert sysvinit.
fr: configure sysvinit.
pt_br: configura sysvinit.

source: configures sysv-rc by disabling listed services.
de: konfiguriert sysv-rc durch abschalten von angegebenen Services.
fr: configure sysv-rc en désactivant les services listés.
pt_br: configura sysv-rc desabilitando serviços listados.

source: disables lastlog.
de: schaltet lastlog ab.
fr: désactive lastlog.
pt_br: desabilita lastlog.

source: disables apport.
de: schaltet apport ab.
fr: désactive apport.
pt_br: desabilita apport.

source: disables lock button for the screen.
de: entfernt den Sperrknopf für den Bildschirm.
fr: désactive le bouton de verrouillage de l'écran.
pt_br: desabilita botão de trava para a tela.

source: disables hibernation.
de: verhindert Hibernation.
fr: désactive l'hibernation.
pt_br: desabilita hibernação.

source: disables the screensaver locking the screen.
de: schaltet das Sperren des Bildschirmes während der Bildschirmschoner läuft ab.
fr: désactive le verrouillage de session par l'économiseur d'écran.
pt_br: desabilita o bloqueio de tela do screensaver.

source: disables KDE migration wizard (squeeze and newer).
de: schaltet den KDE Migration Wizard ab (squeeze und neuer).
fr: désactive l'assistant de migration de KDE (squeeze et plus récent).
pt_br: desabilita o assitente de migração do KDE.

source: disables some unwanted KDE services (squeeze and newer).
de: schaltet ein paar ungewollte KDE Services ab (squeeze und neuer).
fr: désactive des services de KDE non souhaités (squeeze et plus récent).
pt_br: desabilita alguns serviços do KDE não desejados (squeeze e mais recentes).

source: adds debian-installer-launcher on users desktop.
de: fügt debian-installer-launcher auf dem Benutzer Desktop hinzu.
fr: ajoute l'installeur (debian-installer-launcher) sur le bureau des utilisateurs.
pt_br: adiciona o instalador (debian-installer-launcher) na área de trabalho dos usuários.

source: grant user privilegies through policykit.
de: räumt dem Benutzer Privilegien durch policykit ein.
fr: accorde à l'utilisateur des privilèges via le policykit.
pt_br: concede privilégios de usuário através de policykit.

source: regenerating ssl snake-oil certificates.
de: erneuert SSL snake-oil Zertifikate.
fr: regénère les certificats ssl.
pt_br: gera novos certificados ssl.

source: disables update-notifier.
de: schaltet update-notifier ab.
fr: désactive update-notifier.
pt_br: desabilita update-notifier.

source: disables anacron.
de: schaltet anacron aus.
fr: désactive anacron.
pt_br: desabilita anacron.

source: disables util-linux' hwclock.
de: schaltet hwclock von util-linux ab.
fr: désactive util-linux' heure hardware.
pt_br: desabilita o relógio de hardware do util-linux.

source: configures xserver-xorg.
de: konfiguriert xserver-xorg.
fr: configure xserver-xorg.
pt_br: configura o xserver-xorg.

source: B<ureadahead> (ubuntu only)
de: B<ureadahead> (nur Ubuntu)
fr: B<ureadahead> (seulement ubuntu)
pt_br: B<ureadahead> (apenas ubuntu)

source: disables ureadahead.
de: schaltet ureadahead ab.
fr: désactive ureadahead.
pt_br: desabilita ureadahead.

source: recreates openssh-server host keys.
de: erstellt OpenSSH-Server Host Schlüssel.
fr: regénère les clés openssh.
pt_br: recriar chaves do servidor openssh

source: configures xfce4-panel to default settings.
de: konfiguriert Standarteinstellungen für xfce4-panel.

source: allows to run arbitrary commands from a file placed on the live media or an http/ftp server.
de: erlaubt beliebige Kommandos einer Datei auf dem Live Medium oder von einem HTTP/FTP Server auszuführen.

source: FILES
de: DATEIEN
fr: FICHIERS
pt_br: ARQUIVOS

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI
pt_br: VER TAMBÉM

source: More information about live-config and the Live Systems project can be found on the homepage at E<lt>I<http://live-systems.org/>E<gt> and in the manual at E<lt>I<http://live-systems.org/manual/>E<gt>.
de: Weitere Informationen über live-config und das Live Systems Projekt können auf der Homepage unter E<lt>I<http://live-systems.org/>E<gt> und im Handbuch unter E<lt>I<http://live-systems.org/manual/>E<gt> gefunden werden.

source: BUGS
de: FEHLER

source: Bugs can be reported by submitting a bugreport for the live-config package in the Bug Tracking System at E<lt>I<http://bugs.debian.org/>E<gt> or by writing a mail to the Live Systems mailing list at E<lt>I<debian-live@lists.debian.org>E<gt>.
de: Fehler können durch Einreichen eines Fehlerberichtes für das live-config Paket im Debian Bug Tracking System unter E<lt>I<http://bugs.debian.org/>E<gt> oder durch Senden einer E-Mail an die Live Systems Mailing Liste unter E<lt>I<debian-live@lists.debian.org>E<gt> (englischsprachig) mitgeteilt werden.

source: AUTHOR
de: AUTOR
fr: AUTEUR
pt_br: AUTOR

source: live-config was written by Daniel Baumann E<lt>I<mail@daniel-baumann.ch>E<gt>.
de: live-config wurde von Daniel Baumann E<lt>I<mail@daniel-baumann.ch>E<gt> geschrieben.

source: Debian Live Project
fr: Projet Debian Live
pt_br: Projeto Debian Live

source: NAME
fr: NOM
pt_br: NOME

source: B<live-config> - System Configuration Scripts
fr: B<live-config> - Scripts de configuration du système
pt_br: B<live-config> - Scripts para Configuração do Sistema

source: B<live-config> contains the scripts that configure a Debian Live system during the boot process (late userspace).
fr: B<live-config> contient les scripts chargés de configurer le système Live Debian lors du processus de démarrage (late userspace).
pt_br: B<live-config> contém os scripts que configuram um sistema Debian Live durante o processo de inicialização (userspace tardio).

source: B<live-config> can be configured through boot parameters or configuration files. If both mechanisms are used for a certain option, the boot parameters take precedence over the configuration files. When using persistency, B<live-config> scripts are only run once.
fr: B<live-config> peut être configuré en utilisant les paramètres d'amorçage ou les fichiers de configuration. Si ces deux mécanismes sont utilisés pour certaines options, les paramètres d'amorçage sont prioritaires sur les fichiers de configuration. Lorsque l'on utilise la persistance, les scripts B<live-config> ne sont lancés qu'une seule fois.
pt_br: B<live-config> pode ser configurado através de parâmetros de inicialização ou arquivos de configuração. Se ambos mecanismos forem usados para uma determinada opção, os parâmetros de inicialização assumem precedência sobre os arquivos de configuração. Quando usado com persistência, os scripts B<live-config> são executados apenas uma vez.

source: Boot Parameters (scripts)
fr: Parametères d'amorçage (scripts)
pt_br: Parâmetros de Inicialização (scripts)
